here's some example code that demonstrates this issue - a less complicated conditional in constructing `valid_blocks` won't reproduce the problem:

```
locals {
  blocklist = [
    {
      ip          = "192.0.0.8"
      description = "test 1"
	  block_until = "1970-01-01T00:00:00Z"
      # block_until = "2024-01-01T00:00:00Z"
    },
    {
      ip          = "8.8.8.8"
      description = "test 2"
      # block_until = "1970-01-01T00:00:00Z"
      block_until = "2024-01-01T00:00:00Z"
    }
  ]
  valid_blocks = [
    for block in local.blocklist : {
      ip          = block.ip
      description = block.description
    }
    if timecmp(timestamp(), block.block_until) == -1
  ]
}

resource "google_compute_security_policy" "this" {
  name  = "test"

  dynamic "rule" {
    for_each = local.valid_blocks
    iterator = block

    content {
      action   = "deny(502)"
      priority = block.key
      match {
        versioned_expr = "SRC_IPS_V1"
        config {
          src_ip_ranges = [block.value.ip]
        }
      }
      description = block.value.description
    }
  }

  rule {
    action   = "allow"
    priority = "2147483647"
    match {
      versioned_expr = "SRC_IPS_V1"
      config {
        src_ip_ranges = ["*"]
      }
    }
    description = "default allow"
  }
}
```

do the following:

* apply the above terraform code
* check the cloudarmor rule created in GCP, you should see the rule with 1 entry with a description like "test 2"
*  swap the dates by commenting lines 6 and 13 and uncommenting lines 7 and 12
* run a terraform plan - this will show no planned changes even though the contents of `local.valid_blocks` has just changed
* destroy the resource
* terraform apply again
* check the cloudarmor rule in GCP again, description of the rule should now be "test 1"

I think this has something to do with the unusually vague plan output seen below:

```
  # google_compute_security_policy.this will be created
  + resource "google_compute_security_policy" "this" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = "test"
      + project     = (known after apply)
      + self_link   = (known after apply)
      + type        = (known after apply)
    }
```

again, I think the root of this vagueness has to do with the problem described in https://github.com/hashicorp/terraform/issues/28340 . also, I haven't tested a function call other than timecmp in the for loop creating `local.valid_blocks`, but i know that having a boolean compare instead of comparing the output of a function doesn't reproduce the issue. the above code below for example works fine:

```
  blocklist = [
	{
	  ip           = "192.0.0.8"
	  should_block = true
	},
	{
	  ip           = "8.8.8.8"
	  should_block = false
	}
  ]
  valid_blocks = [
	for block in local.blocklist : block.ip
	if block.should_block
  ]
```
